[
  {
    "id": "18da7d4a-91b9-44d6-9229-a736b204deca",
    "title": "Plain Text Page",
    "urlPath": "plain-text-page",
    "blocks": [
      {
        "component": "Paragraph",
        "text": "This page doesn’t have any components. It’s just a bunch of text."
      },
      {
        "component": "Paragraph",
        "text": "Nulla commodo dolore culpa aute Lorem nostrud dolore ullamco consequat aliquip consequat. Nostrud veniam ex proident magna ipsum. Mollit deserunt fugiat ad sunt ipsum occaecat dolor cupidatat nisi. Eiusmod exercitation laborum nisi exercitation est eiusmod nisi esse. Qui incididunt exercitation incididunt sint nisi mollit ullamco pariatur laboris enim Lorem. Excepteur eu eu quis ea qui amet ea consectetur occaecat eiusmod est incididunt."
      },
      {
        "component": "Paragraph",
        "text": "Irure enim reprehenderit voluptate quis ullamco culpa veniam deserunt. Labore sit enim quis sunt reprehenderit commodo. Nisi non anim nulla cillum consectetur est aliquip. Eu adipisicing exercitation mollit ipsum ea mollit aliquip irure do deserunt anim laboris aute. Minim adipisicing enim Lorem irure fugiat nisi id ad elit labore duis sit. Laboris cillum do pariatur officia proident deserunt deserunt cillum occaecat."
      },
      {
        "component": "Paragraph",
        "text": "Dolor irure consequat elit laboris occaecat et ullamco minim do esse in. Ea commodo nisi cillum exercitation in consequat dolore aliquip proident. Ex adipisicing laborum consectetur occaecat."
      },
      {
        "component": "Paragraph",
        "text": "Amet nostrud mollit id magna sunt in officia labore est. Anim nisi irure irure id sunt aliqua laboris magna esse ea cupidatat. Excepteur enim nisi nulla elit aliquip. Tempor nulla mollit eu ullamco ipsum nostrud non enim."
      }
    ]
  },
  {
    "id": "e6e75b78-8671-4347-9bff-9ce2863836f3",
    "title": "Page with Components",
    "urlPath": "page-with-components",
    "blocks": [
      {
        "component": "Paragraph",
        "text": "We can show a series of tabs using a callout that notes itself as a tab component using an icon."
      },
      {
        "component": "Tabs",
        "tabs": [
          {
            "label": "Tab #1",
            "text": "This is content within the tabs."
          },
          {
            "label": "Tab #2",
            "text": "Qui ex tempor quis aliquip do veniam ea reprehenderit irure dolore duis. Ut cillum sint enim dolor eiusmod nulla reprehenderit proident tempor voluptate in. Pariatur officia anim et ea. Esse amet cupidatat cillum dolor laborum voluptate pariatur Lorem consequat amet."
          },
          {
            "label": "Tab #3",
            "text": "Aliquip incididunt labore sint nisi. Reprehenderit irure laboris commodo id ut Lorem id ullamco nisi. Id id magna id incididunt cupidatat ullamco enim voluptate enim."
          }
        ]
      },
      {
        "component": "Paragraph",
        "text": "We could do the same thing with a code block, where one sub-callout designates the filename of the block, which gets stylistically placed above the code."
      },
      {
        "component": "CodeBlock",
        "filename": "hello-world.js",
        "code": "<span class=\"hljs-keyword\">function</span> <span class=\"hljs-title function_\">helloWorld</span>(<span class=\"hljs-params\"></span>) {\n  <span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-title function_\">log</span>(<span class=\"hljs-string\">&quot;Hello World&quot;</span>);\n}",
        "language": "javascript"
      }
    ]
  }
]